SUDHEER74/LPC2148-RTC-Scheduled-Device-Control/Source/RTCLOCK.c
#include <lpc214x.h>
#include "rtclock.h"

#define FOSC 12000000
#define CCLK (5 * FOSC)
#define PCLK (CCLK / 4)

#define PREINT_VAL  ((int)(PCLK / 32768) - 1)
#define PREFRAC_VAL (PCLK - ((PREINT_VAL + 1) * 32768))

#define RTC_ENABLE (1 << 0)
#define RTC_RESET  (1 << 1)


/* RTC Initialization */
void RTC_Init(void)
{
    /* Disable and reset RTC */
    CCR = RTC_RESET;

    /* Configure RTC prescaler */
    PREINT  = PREINT_VAL;
    PREFRAC = PREFRAC_VAL;

    /* Enable RTC */
    CCR = RTC_ENABLE;
}


/* Set RTC Time */
void SetRTCTimeInfo(u32 hour, u32 minute, u32 second)
{
    HOUR = hour;
    MIN  = minute;
    SEC  = second;
}


/* Get RTC Time */
void GetRTCTimeInfo(s32 *hour, s32 *minute, s32 *second)
{
    *hour   = HOUR;
    *minute = MIN;
    *second = SEC;
}


/* Set RTC Date */
void SetRTCDateInfo(u32 date, u32 month, u32 year)
{
    DOM   = date;
    MONTH = month;
    YEAR  = year;
}


/* Get RTC Date */
void GetRTCDateInfo(s32 *date, s32 *month, s32 *year)
{
    *date  = DOM;
    *month = MONTH;
    *year  = YEAR;
}


/* Set Day of Week */
void SetRTCDay(u32 dow)
{
    DOW = dow;
}


/* Get Day of Week */
void GetRTCDay(s32 *dow)
{
    *dow = DOW;
}



